{
    "templates": [
        {
            "tags": [
                "Fiction"
            ],
            "name": "Short Story",
            "description": "A short story is a brief work of fiction that is usually written in prose. It's typically focused on a single plot, character, or theme, offering a snapshot or a brief glimpse into a larger narrative world. Unlike novels, short stories are designed to convey a complete narrative experience in a limited word count.",
            "methodology": "Idea Generation: Begin with brainstorming ideas. This could be a character, a scene, a conflict, or a particular emotion you want to convey.\nResearch: If the story touches on specific topics, cultures, historical events, or settings, conduct thorough research to ensure accuracy and authenticity.\nOutlining: While not all writers outline short stories, having a rough roadmap can help in maintaining focus, especially given the limited word count.\nDrafting: Write the first draft, letting the story flow without worrying too much about the word count or editing.\nRevising: Go back and refine the narrative. This could involve expanding some parts, trimming others, or altering the story for better clarity and impact.\nEditing: Focus on grammar, punctuation, and stylistic choices to polish the story.\nFinalizing: Read the story out loud, get feedback from peers or editors, and make final touches before considering it complete.",
            "genres": [
                "Literary Fiction",
                "Mystery/Thriller",
                "Science Fiction",
                "Fantasy",
                "Romance",
                "Historical Fiction",
                "Horror",
                "Speculative Fiction",
                "Drama",
                "Comedy"
            ],
            "length": "Typically 1 to 20 pages. Ranges from 1,000 to 7,500 words. A typical median value is around 3,500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Fiction"
            ],
            "name": "Novel or Novella",
            "description": "A novel is a lengthy work of fiction, characterized by its intricate plot, multifaceted characters, and detailed settings. It delves deep into themes, conflicts, and narratives. A novella, on the other hand, sits between a short story and a novel in terms of length. While it offers a more expansive narrative than a short story, it is more concise than a full-fledged novel, often focusing on a single character or incident.",
            "methodology": "Idea Generation: Start by conceptualizing a central theme, character, or conflict that will drive the narrative.\nResearch: Depending on the novel's setting, theme, or period, extensive research may be needed to bring authenticity.\nPlot Development: Craft a detailed outline of the plot, including major events, character arcs, and story climax.\nCharacter Development: Flesh out primary and secondary characters, their motivations, relationships, and growth throughout the story.\nDrafting: Begin the process of writing, focusing on getting the story down without excessive self-editing.\nSubsequent Drafts: Refine the narrative, develop subplots, enhance character interactions, and ensure pacing and tension are maintained.\nEditing: Address grammar, style, continuity errors, and narrative inconsistencies. This stage might involve several iterations.\nBeta Reading: Share the manuscript with a group of beta readers for feedback on plot, character believability, and overall engagement.\nFinal Revisions: Incorporate feedback, finalize the narrative, and make any last adjustments.\nFinalizing: Have the work professionally edited, proofread, and then prepare for publication or submission.",
            "genres": [
                "Literary Fiction",
                "Romantic Fiction",
                "Historical Fiction",
                "Mystery/Thriller",
                "Science Fiction",
                "Fantasy",
                "Horror",
                "Adventure",
                "Dystopian",
                "Crime",
                "Young Adult",
                "Paranormal",
                "Erotica",
                "Speculative Fiction",
                "Drama"
            ],
            "length": "For a novel, typically 200 to 500 pages. Ranges from 50,000 to 120,000 words, with a median of 80,000 words. For a novella, typically 60 to 200 pages, ranging from 20,000 to 50,000 words, with a median of 30,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Fiction"
            ],
            "name": "Flash Fiction",
            "description": "Flash Fiction, also known as micro-fiction, is a very brief work of fiction, notable for its brevity and intended to be read in just a few minutes. It encapsulates an entire narrative or a pivotal moment within a constrained word limit. The challenge and art of flash fiction lie in conveying a complete story, with setting, characters, and plot, in as few words as possible.",
            "methodology": "Idea Generation: Start with a single, impactful idea or emotion you want to convey. Due to the brevity, the focus is often on a singular event or twist.\nBrainstorming: Think of the most concise way to depict the setting, characters, and plot to fit the constrained word limit.\nDrafting: Write the first draft, keeping it within the word constraints while ensuring a clear and compelling narrative.\nRevising: Given the brevity, every word counts. Refine for clarity, emotional impact, and narrative strength.\nEditing: Focus on grammar, punctuation, and word choice to ensure the story is as polished as possible within the tight constraints.\nFinalizing: Read aloud, possibly multiple times, to ensure fluidity and rhythm. Get feedback for clarity and impact, making adjustments as needed.",
            "genres": [
                "Literary Fiction",
                "Mystery",
                "Science Fiction",
                "Fantasy",
                "Romance",
                "Horror",
                "Drama",
                "Comedy",
                "Historical",
                "Speculative Fiction"
            ],
            "length": "Typically 1 to 2 pages. Ranges from 50 to 1,500 words, though most flash fiction pieces stay under 500 words. A typical median value is around 300 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Fiction"
            ],
            "name": "Picture Book",
            "description": "A picture book is a type of book, usually designed for children, where illustrations and visuals play a primary role, often complementing or even driving the narrative. While they can be purely illustrative without any text, many picture books combine short, simple texts with vibrant images to convey a story, making them perfect for read-aloud sessions. The interplay between text and images is crucial, and the visuals often carry equal, if not more, weight than the words.",
            "methodology": "Conceptualization: Start by identifying the core theme or message. Determine whether the story will be driven by text, images, or both.\nStoryboarding: Create a rough storyboard to visualize how the narrative will flow across the pages. This can be in the form of rough sketches or descriptions.\nWriting: Draft the text, ensuring it's concise and complements the illustrations. The tone is typically simple and direct.\nIllustration: Depending on the collaboration, either illustrate yourself or work with an illustrator to bring the story to life visually. The images should align with the text and enhance the narrative.\nLayout Design: Focus on the layout, ensuring that text and illustrations are harmoniously integrated. This may involve working with a designer.\nReview and Feedback: Read aloud, preferably to children, to gauge reactions. Revise based on feedback.\nFinalizing: Make final edits to the text and illustrations, ensuring a seamless blend and flow.",
            "genres": [
                "Fantasy",
                "Adventure",
                "Realistic Fiction",
                "Non-Fiction",
                "Folktales",
                "Fairy Tales",
                "Historical",
                "Learn to Read",
                "Concept Books",
                "Rhyming",
                "Cultural Stories"
            ],
            "length": "Typically 24 to 40 pages. Ranges from 200 to 1,000 words, though many picture books might have significantly fewer words or even none. A typical median value is around 500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Fiction"
            ],
            "name": "Interactive Fiction",
            "description": "Interactive fiction, often abbreviated as IF, is a narrative-driven game or story where the reader or player's choices influence the outcome. Typically presented in a text-based format, it's akin to a 'choose your own adventure' book, but can be digital and sometimes accompanied by graphics or audio elements. The narrative branches based on user decisions, leading to multiple endings and varied story experiences.",
            "methodology": "Conceptualization: Identify the core theme, setting, and tone of the story. Decide on the primary plot points and potential decision-based divergences.\nBranching Narrative Design: Map out the main story paths and how choices will affect the narrative direction. This can be visualized with flowcharts or specialized software.\nWriting: Draft the primary narrative and the alternative paths. Ensure smooth transitions between choices and that each path provides a satisfying story experience.\nProgramming/Integration: For digital formats, integrate the narrative into an interactive platform, like Twine or Inform, enabling the decision-making mechanics.\nTesting: Playtest the story multiple times, ensuring that all paths work, lead to logical outcomes, and that there are no dead-ends or unresolved storylines.\nFeedback and Iteration: Gain feedback from players, focusing on the narrative flow, decision impact, and overall immersion. Adjust based on feedback.\nFinalizing: Ensure all narrative branches are cohesive, polished, and offer rewarding conclusions. For digital versions, ensure compatibility across devices/platforms.",
            "genres": [
                "Fantasy",
                "Science Fiction",
                "Mystery/Thriller",
                "Horror",
                "Romance",
                "Historical",
                "Adventure",
                "Drama",
                "Comedy",
                "Speculative Fiction"
            ],
            "length": "Due to its branching nature, length can vary widely. A typical interactive fiction piece might have 10,000 to 100,000 words in total, but individual playthroughs might only expose the reader to a fraction of this, often around 20,000 words. Page count can vary based on medium, but in digital formats, this is often not applicable.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Screenplay (Movie)",
            "description": "A screenplay, specifically for movies, is a written work by screenwriters for a film. Unlike other forms of writing, it follows a strict format and is predominantly a blueprint for production, detailing scenes, dialogue, transitions, and some direction cues. It's a visual medium, where the narrative is primarily conveyed through dialogue and visual descriptions, intended to be translated into visual art by filmmakers.",
            "methodology": "Conceptualization: Define the core premise, themes, and tone. Understand the three-act structure typical of most films: setup, confrontation, and resolution.\nOutlining: Break down the story into sequences and scenes. Determine key plot points, character arcs, and the climax.\nResearch: If applicable, delve into topics, settings, or historical periods to bring authenticity to the narrative.\nDrafting: Write the first draft focusing on the narrative flow, adhering to screenplay format guidelines. Software like Final Draft or Celtx can help maintain proper formatting.\nRevising: Refine the story, focusing on pacing, dialogue, character development, and visual storytelling. This might involve adding or cutting scenes, or enhancing character dialogue.\nFeedback: Have peers, other writers, or industry professionals read and critique the screenplay. Their insights can provide valuable perspective on the story's strengths and weaknesses.\nPolishing: Refine based on feedback, paying attention to pacing, character arcs, dialogue sharpness, and potential production constraints.\nFinal Draft: Ensure the screenplay is in the industry-standard format and free of errors or inconsistencies. Typically, this version is what's submitted to agents, contests, or producers.",
            "genres": [
                "Drama",
                "Comedy",
                "Action",
                "Horror",
                "Sci-Fi",
                "Fantasy",
                "Romantic Comedy",
                "Historical",
                "Thriller",
                "Mystery"
            ],
            "length": "Typically between 90 to 120 pages, with each page roughly equating to a minute of screen time. This results in most films being between 90 to 120 minutes. The word count can vary significantly due to the format, but an average screenplay might contain around 20,000 to 25,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Episodic Screenplay or Series",
            "description": "An episodic screenplay or series script refers to the written work for television or streaming series episodes. Unlike movie screenplays, episodic screenplays account for serialized, ongoing narratives that develop characters, plots, and themes over multiple episodes and often seasons. Each episode offers a self-contained narrative while also contributing to the overarching storyline. The format is similar to movie screenplays but is adjusted to fit the episodic nature of the medium.",
            "methodology": "Series Concept: Determine the overall theme, tone, and direction for the series. This encompasses the general plot, character arcs, and the evolution across seasons.\nEpisode Brainstorming: Break down the series into individual episodes, each with its own narrative while ensuring it fits within the series' larger plot.\nResearch: Delve into relevant topics, settings, or historical periods pertinent to the series for authenticity.\nEpisode Outlining: For each episode, outline key events, character developments, and how it moves the overall series narrative forward.\nDrafting: Write the initial draft for each episode, ensuring it adheres to the typical screenplay format.\nRevising: Refine individual episodes, emphasizing pacing, dialogue, and the integration of each episode into the season's broader narrative.\nFeedback: Seek input from peers, other writers, or industry experts to gain insights into the episodic narrative's strength and potential improvements.\nPolishing: Implement feedback and refine the screenplay. Ensure that each episode flows seamlessly into the next, and there's consistency in tone, character development, and theme.\nFinal Draft: Assure each episode's script aligns with industry standards and is devoid of errors. This finalized version is usually presented to producers, networks, or other stakeholders.",
            "genres": [
                "Drama",
                "Comedy",
                "Crime",
                "Fantasy",
                "Sci-Fi",
                "Historical",
                "Thriller",
                "Mystery",
                "Horror",
                "Romantic Comedy"
            ],
            "length": "A typical episode for a drama series ranges between 45 to 60 pages, equating to about a 45 to 60-minute runtime, whereas comedy series episodes are usually shorter, around 22 to 30 pages, translating to a 22 to 30-minute runtime. The word count can vary, but a drama episode might be around 7,000 to 10,000 words, while a comedy episode could be 5,000 to 7,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Radio Play or Podcast",
            "description": "A radio play or podcast script is a written narrative specifically crafted for auditory presentation. Unlike visual mediums like film or TV, radio plays and podcast scripts rely heavily on dialogue, sound effects, and music to convey setting, plot, and character emotions. The narrative can be fiction, a historical retelling, a drama, or even an educational piece. The emphasis is on creating a rich auditory experience, ensuring listeners remain engaged and immersed without visual aids.",
            "methodology": "Theme Definition: Decide on the overarching theme or story. For series, understand the broader narrative and individual episode arcs.\nIdea Brainstorming: Generate main plot points, characters, settings, and potential sound cues or music integrations.\nResearch: Delve into any specific topics, eras, or events to ensure accurate representation. This might include historical settings, cultural nuances, or specific soundscapes.\nOutlining: Create a structure for the play or podcast. Break down acts or sections, detailing key events and character interactions.\nDrafting: Write the initial script focusing on dialogue, auditory cues, sound effects, and potential music inserts. Remember, everything needs to be conveyed through sound.\nRevisions: Go back and enhance the narrative. This could mean enriching the dialogue, adjusting pacing, or refining sound cues to amplify the listening experience.\nSoundscaping: Outline or make notes for specific sound effects or musical cues integral to the narrative.\nFeedback Loop: Seek input from others to gauge how effectively the story conveys without visual aids. Adjust based on feedback.\nFinal Draft: Polish the script ensuring clarity in instructions for sound effects, dialogue delivery, and music.",
            "genres": [
                "Drama",
                "Comedy",
                "Mystery",
                "Science Fiction",
                "Historical Retelling",
                "Horror",
                "Romantic",
                "Adventure",
                "Educational",
                "Documentary"
            ],
            "length": "Typically ranges from 15 to 60 minutes for a single episode. In terms of script pages, it can vary from 15 to 60 pages, given the rough guideline of one minute per script page. Word counts can range from 2,500 to 10,000 words for an episode, with a median value often sitting around 5,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Three-Act Play",
            "description": "A three-act play is a structured theatrical performance that divides the narrative into three distinct segments or acts. Each act serves a purpose in the storytelling arc: the first introduces characters and establishes the conflict, the second delves into the complication and development of the plot, and the third culminates in the climax and resolution. This structure provides a clear narrative progression, ensuring a balanced pacing and development of the story on stage.",
            "methodology": "Conceptualization: Start with a core idea, theme, or conflict that will drive the narrative.\nCharacter Development: Flesh out the characters, understanding their motivations, relationships, and arcs.\nResearch: Dive into any relevant topics, settings, or periods to ensure authenticity and depth in the portrayal.\nAct Breakdown: Determine the major events and turning points that will occur in each act. This provides a roadmap for the narrative progression.\nDrafting: Begin writing the dialogue, stage directions, and interactions for each scene, keeping in mind the trajectory of each act.\nRevising: Review the script to adjust pacing, character interactions, and thematic emphasis. This may involve adding or removing scenes to maintain the balance of the three acts.\nWorkshops/Read-Throughs: Engage with actors or peers for a reading or workshop to gain insights into dialogue flow, character believability, and pacing.\nEditing: Refine grammar, language choice, and stage directions for clarity.\nFinal Draft and Rehearsal Notes: Complete the script with any additional notes or directions that would aid in the staging and performance of the play.",
            "genres": [
                "Drama",
                "Comedy",
                "Tragedy",
                "Historical",
                "Romantic",
                "Mystery",
                "Fantasy",
                "Satire",
                "Farce",
                "Melodrama"
            ],
            "length": "Typically 90 to 120 minutes when performed. In terms of script pages, this equates to approximately 90 to 120 pages, considering the rough guideline of one minute per script page. Word counts can vary significantly based on dialogue density and stage directions, but generally range from 20,000 to 30,000 words, with a median value around 25,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Musical or Opera",
            "description": "A musical or opera script serves as the backbone for a theatrical performance that integrates songs, dialogue, and dance to convey a narrative. Musicals often combine elements of spoken theatre with popular musical styles, while operas are typically through-sung, meaning they have continuous musical performance without spoken dialogue. Both formats rely heavily on musical numbers to further the plot, reveal character emotions, or express thematic elements. The unique blend of music and drama makes for a rich and immersive storytelling experience.",
            "methodology": "Conceptualization: Identify a compelling story, theme, or concept that would benefit from musical exploration.\nSong Placement: Determine where songs or musical numbers will be placed in relation to the narrative. These could be character solos, duets, ensemble pieces, or instrumental interludes.\nCharacter Development: Create characters with distinct personalities, arcs, and motivations, considering how music can help express their internal emotions and journeys.\nResearch: If the narrative touches on specific events, cultures, or historical periods, conduct research to ensure accuracy and depth.\nCollaboration: Work with a composer/lyricist (if the writer is not taking on these roles) to craft songs that are thematically and emotionally aligned with the narrative. This involves iterative feedback and revisions.\nDrafting: Write the dialogue, stage directions, and song lyrics, ensuring a cohesive flow between spoken and sung elements.\nWorkshopping: Engage with actors, singers, and musicians to workshop scenes and songs, refining based on feedback and practical constraints of staging.\nRevisions: Iterate on the script and musical numbers, adjusting for pacing, character development, and thematic resonance.\nFinal Draft: Finalize the script, musical notations, and any additional notes for direction or choreography.",
            "genres": [
                "Romantic",
                "Comedy",
                "Drama",
                "Tragedy",
                "Historical",
                "Fantasy",
                "Mystery",
                "Satire",
                "Adaptation",
                "Contemporary"
            ],
            "length": "Musicals and operas vary widely in length. A typical performance might run between 90 to 180 minutes, which equates to a script of approximately 90 to 180 pages. Word count can range from 15,000 to 40,000 words, considering dialogue, stage directions, and song lyrics. A median value would be around 25,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Video Game Storyline and Dialogue",
            "description": "A video game storyline and dialogue template involves crafting the overarching narrative and in-game conversations that guide players through interactive digital experiences. It's a blend of traditional storytelling and dynamic, player-driven choices, often weaving together multiple plotlines or branching narratives. The narrative, characters, and dialogue contribute to the game's immersive experience, often working in tandem with game mechanics, graphics, and sound to create a cohesive and compelling virtual world.",
            "methodology": "Concept Development: Understand the game's mechanics, genre, and desired player experience to devise a fitting story.\nWorld-building: Establish the universe, its rules, history, cultures, and significant locations.\nCharacter Creation: Develop main, secondary, and tertiary characters, each with distinct personalities, backstories, and arcs.\nBranching Narrative: Design multiple story paths or outcomes based on player choices, considering how these branches merge or diverge.\nDialogue Writing: Craft in-game conversations, considering character personalities and the tone of the game.\nCollaboration: Work closely with game designers, developers, and artists to ensure narrative coherence with gameplay elements.\nPlaytesting: Test the narrative within the game, refining based on player feedback and in-game experiences.\nRevision: Iterate on the story and dialogue as the game undergoes changes in mechanics, level design, or other core elements.\nIntegration: Ensure that the narrative elements are smoothly integrated with gameplay, music, graphics, and voice acting.\nFinal Review: Play through the final game version to ensure the narrative flows seamlessly and provides a fulfilling player experience.",
            "genres": [
                "Action/Adventure",
                "Role-Playing Game (RPG)",
                "Horror",
                "Fantasy",
                "Science Fiction",
                "Simulation",
                "Mystery",
                "Historical",
                "Survival",
                "Strategy"
            ],
            "length": "The length of a video game storyline and dialogue can vary tremendously based on the genre and complexity of the game. A linear, story-driven game might have a script ranging from 30,000 to 100,000 words, while an expansive role-playing game can exceed 500,000 words. On average, a narrative-centric game might have around 70,000 words. In terms of pages, it can range from 100 to over 1,000 pages, with a median value of around 300 pages.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Documentary",
            "description": "A documentary is a non-fictional, motion picture intended to document and portray factual events, people, real-life situations, or previously unknown hidden occurrences. It often aims to inform, educate, entertain, or provoke critical thinking in its audience. Documentaries present facts and perspectives either through the narrative voice or by allowing subjects to narrate their own stories.",
            "methodology": "Topic Selection: Identify a relevant, interesting, or little-known subject matter that has substantial depth for exploration.\nResearch: Dive deeply into the topic, gathering books, articles, interviews, archival footage, and any other relevant materials.\nPlanning: Develop a storyboard or rough outline, defining the structure, main points, and flow of the documentary.\nFieldwork: Conduct interviews, capture footage, visit locations, and record anything that provides insight or visual representation of the topic.\nEditing: Stitch together the captured material, arrange them to create a coherent narrative, and add voiceovers, graphics, or animations if necessary.\nPost-production: Fine-tune the video and audio quality, add music or sound effects, and ensure the pacing and tone align with the intended message.\nFeedback Loop: Screen the documentary to peers, experts, or test audiences, gathering feedback and making revisions accordingly.\nFinalization: Incorporate final changes and ensure the documentary is polished for its intended platform or audience.\nDistribution: Depending on the intent, release the documentary through film festivals, TV networks, streaming platforms, or educational venues.",
            "genres": [
                "Historical",
                "Investigative",
                "Nature and Wildlife",
                "Biographical",
                "Cultural/Social Commentary",
                "Science and Technology",
                "Travel and Exploration",
                "Political",
                "Health and Wellness",
                "Personal Narrative"
            ],
            "length": "Documentaries can vary widely in length. Short documentaries might range from 15 to 40 minutes. Feature-length documentaries typically run between 70 to 120 minutes. In terms of script pages, short documentaries might be 15 to 40 pages, while feature-length can range from 70 to 120 pages. The word count would approximately be 150 words per page, giving a typical range of 2,250 to 6,000 words for short documentaries and 10,500 to 18,000 words for feature-length.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script",
                "Dialogue"
            ],
            "name": "Stand-up Comedy",
            "description": "Stand-up comedy is a comedic performance where a comedian entertains an audience with a series of humorous stories, jokes, and one-liners, typically delivered in a spontaneous and conversational style. The content often reflects personal anecdotes, observations about everyday life, or social and political commentary, all presented in a way designed to evoke laughter.",
            "methodology": "Topic Selection: Identify relatable or intriguing subjects that have the potential for humor.\nBrainstorming: Jot down funny observations, experiences, or thoughts related to the chosen topics.\nDrafting: Turn these ideas into structured jokes, stories, or routines, ensuring a setup and punchline.\nTesting: Perform the material in front of small groups or at open mics to gauge audience reaction and refine the content based on feedback.\nRevising: Adjust timing, wording, or delivery based on live reactions to optimize comedic impact.\nMemorization: Commit the polished routine to memory while still allowing room for improvisation during live performances.\nPerformance: Deliver the final routine in front of larger audiences, while being adaptive to the crowd's energy and feedback.\nContinuous Improvement: Based on audience reactions and personal growth, regularly update, modify, or add to the routine over time.",
            "genres": [
                "Observational",
                "Political",
                "Dark Humor",
                "Satire",
                "Slapstick",
                "Anecdotal",
                "Deadpan",
                "Cringe Comedy",
                "Prop Comedy",
                "Blue Comedy"
            ],
            "length": "Stand-up comedy sets can vary in length. Open mic sets are typically 5 to 10 minutes. Feature sets can be 15 to 30 minutes, while headlining sets can range from 45 minutes to an hour or more. In terms of word count, a 5-minute set might contain 600-750 words, a 30-minute set around 3,600 to 4,500 words, and an hour-long set can be 7,200 to 9,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Comics",
                "Graphics"
            ],
            "name": "Comic Book",
            "description": "A comic book is a publication that uses a series of illustrations and captions to tell a story or convey information. The narrative is presented through a combination of graphics, dialogue, and descriptive prose, structured in a sequence of panels. Comic books can tackle a variety of genres and themes, and they are a unique medium where visual artistry and written word collaborate to produce storytelling dynamics.",
            "methodology": "Conceptualization: Start by defining the main idea, characters, and setting of the comic.\nStoryboarding: Sketch a rough layout of the comic's pages, defining the sequence of panels and their content.\nScripting: Write the dialogue, captions, and any narrative text for each panel.\nArt Production: Begin with penciling the detailed illustrations, followed by inking to finalize the line art, and then apply colors and shading.\nLettering: Integrate the scripted dialogue, captions, and other text elements into the illustrated panels, ensuring readability and flow.\nEditing: Review the comic for consistency in art and narrative. Adjust illustrations or text as needed.\nFinalization: Prepare the comic for print or digital distribution. This may include formatting, cover design, and other finishing touches.\nPublishing: Depending on the intended platform, this could involve printing physical copies, or distributing digitally through various platforms or websites.",
            "genres": [
                "Superhero",
                "Fantasy",
                "Science Fiction",
                "Horror",
                "Mystery",
                "Historical",
                "Romance",
                "Adventure",
                "Noir",
                "Slice of Life"
            ],
            "length": "A single issue of a comic book typically ranges from 20 to 32 pages, including advertisements. The actual content might be 18 to 30 pages. In terms of word count, a single page might contain 50 to 200 words depending on the density of dialogue and captions, making a typical issue range from 900 to 6,000 words. Graphic novels or collected editions will have significantly more pages, often ranging from 60 to 200+ pages.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Comics",
                "Graphics"
            ],
            "name": "Graphic Novel",
            "description": "A graphic novel is a book-length work of fiction or nonfiction that uses the conventions of comic art. It weaves together illustrations and text to convey deep, intricate narratives or to explore complex ideas and themes. Unlike traditional comic books which are often part of a larger series, a graphic novel typically presents a standalone story or a cohesive arc of a series. The medium allows for a rich interplay between visual and written storytelling, granting it a unique versatility in expressing nuanced tales and concepts.",
            "methodology": "Concept and Theme Identification: Define the overarching idea or narrative arc for the graphic novel.\nCharacter Development: Flesh out the main characters, their appearances, backstories, motivations, and roles within the narrative.\nStoryboarding: Create a preliminary visual sequence of the story, establishing the flow and major plot points.\nScripting: Detail the dialogue, captions, and narrative cues for each segment or page of the novel.\nIllustration: Begin the art production process, starting with rough sketches, then inking, followed by coloring and shading. This phase is more detailed and intensive compared to regular comics due to the length and depth of graphic novels.\nLettering: Incorporate the written elements into the illustrations, ensuring clarity and narrative flow.\nReview and Editing: Go through the entire novel to refine the artwork and text, ensuring coherence, consistency, and emotional resonance.\nFinalization: Get the graphic novel ready for publication, which includes formatting, cover design, and other finishing touches.",
            "genres": [
                "Epic Fantasy",
                "Historical Fiction",
                "Memoir/Biography",
                "Science Fiction",
                "Mystery/Thriller",
                "Romance",
                "Horror",
                "Philosophical",
                "Realistic Fiction",
                "Adventure"
            ],
            "length": "A typical graphic novel ranges from 60 to 200 pages, but some can be considerably longer, especially if part of a series. In terms of word count, given the visual nature of the medium, it can vary greatly. A single page might have 50 to 300 words, depending on dialogue and caption density. Thus, a median graphic novel might range from 3,000 to 60,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Comics",
                "Graphics",
                "RPG",
                "Role-Playing"
            ],
            "name": "Role-Playing Game (RPG) Campaign Guide",
            "description": "A Role-Playing Game (RPG) Campaign Guide is a detailed blueprint for a series of interconnected adventures or scenarios within a role-playing game. The guide establishes the setting, lore, main and side quests, NPCs (Non-Player Characters), challenges, and outcomes, allowing a game master (GM) or dungeon master (DM) to guide players through a narrative journey. These guides can be tailored to fit various game systems and aim to provide an immersive experience, often filled with choices and branching paths that respond to player decisions.",
            "methodology": "World Building: Develop the broader universe or setting of the campaign. This involves creating histories, geographies, cultures, and key factions.\nMain Quest Design: Outline the central narrative arc or the primary objective for the players, breaking it down into a series of sessions or adventures.\nSide Quest Design: Develop optional challenges, stories, and adventures that players can undertake apart from the main quest.\nCharacter Creation: Design key NPCs, their motivations, backstories, and how they interact with the players. This includes allies, antagonists, and neutral characters.\nEncounter Design: Plan specific combat and non-combat challenges, puzzles, and obstacles that players will face, determining their difficulty and rewards.\nLore Compilation: Detail the myths, legends, and other background information that adds depth and richness to the setting.\nPlaytesting: Run a few sessions with a group to identify any potential issues or imbalances and adjust accordingly.\nFinalization: Compile everything into a cohesive guide, including any maps, character sheets, item lists, and other appendices useful for the GM/DM.",
            "genres": [
                "Fantasy",
                "Science Fiction",
                "Horror",
                "Historical",
                "Mystery/Thriller",
                "Post-Apocalyptic",
                "Steampunk",
                "Urban Fantasy",
                "Western",
                "Superhero"
            ],
            "length": "An RPG Campaign Guide can vary widely in length, depending on its complexity and depth. Typically, they range from 30 to 300 pages. In terms of word count, they can be as short as 10,000 words for more straightforward campaigns to over 100,000 words for expansive, intricate guides. A typical median value might be around 50,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Series",
                "Fiction"
            ],
            "name": "Short Story Collection",
            "description": "A Short Story Collection is an anthology of short stories curated by a single author or multiple authors. Each story in the collection is self-contained, though they may share common themes, settings, or characters. The collection provides readers with varied glimpses into different worlds and narratives, allowing for diverse exploration within a single volume. Collections can be thematically linked or offer a range of disparate tales, depending on the author's or curator's intention.",
            "methodology": "Theme Identification: Decide if the collection will have a central theme or concept that binds the stories together.\nStory Selection: Choose previously written stories or draft new ones that fit within the desired theme or scope of the collection.\nOrdering: Determine the sequence in which the stories will appear, considering pacing, tone, and thematic resonance.\nTransitions: Decide if there will be any interludes, introductions, or connecting pieces between stories.\nRevising: Review each story individually for coherence, clarity, and impact. Adjust as necessary to fit the broader context of the collection.\nFeedback: Share the collection with peers, beta readers, or editors for feedback on flow, cohesion, and overall impact.\nFinalizing: Incorporate feedback, make final edits, and decide on any additional elements like a foreword, afterword, or author's note.",
            "genres": [
                "Literary Fiction",
                "Mystery/Thriller",
                "Science Fiction",
                "Fantasy",
                "Romance",
                "Historical Fiction",
                "Horror",
                "Speculative Fiction",
                "Drama",
                "Comedy",
                "Magical Realism",
                "Slice of Life",
                "Adventure"
            ],
            "length": "A Short Story Collection can range from 100 to 500 pages. In terms of word count, collections typically span from 20,000 to 150,000 words, depending on the number and length of the stories included. A typical median value might be around 60,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Series",
                "Fiction"
            ],
            "name": "Fantasy or Science Fiction Series",
            "description": "A Fantasy or Science Fiction Series is a sequence of novels or books that share a common universe, characters, or overarching narrative. Each installment advances the plot, deepens the lore, or explores different facets of the universe. Often, such series possess intricate worlds with elaborate histories, diverse cultures, and unique magic or technological systems. They provide readers with immersive experiences, often culminating in epic showdowns, profound character development, or significant world-altering events.",
            "methodology": "World Building: Establish the universe, its rules, history, magic or technological systems, and cultures. Develop a series bible to keep details consistent.\nPlot Development: Outline the overarching story arc for the series, identifying key events, conflicts, and resolutions for each installment.\nCharacter Design: Create central characters, their backstories, relationships, and development arcs throughout the series.\nDrafting: Write the first book while keeping in mind the overarching narrative. It's essential to maintain pacing and ensure each installment has its beginning, middle, and end, while also fitting into the larger series arc.\nFeedback and Revision: After finishing each book, get feedback, and revise accordingly. This step may involve adjusting elements in the series bible or the planned arc based on the evolving story or reader feedback.\nConsistency Check: As subsequent books are written, revisit earlier entries to ensure continuity and consistency in details.\nFinalizing: With each book, go through the editing, polishing, and publishing process. After completing the series, consider any supplementary material like prequels, spin-offs, or lore guides.",
            "genres": [
                "High Fantasy",
                "Epic Fantasy",
                "Urban Fantasy",
                "Dark Fantasy",
                "Space Opera",
                "Dystopian",
                "Cyberpunk",
                "Steampunk",
                "Post-Apocalyptic",
                "Military Science Fiction",
                "Time Travel",
                "Parallel Universes"
            ],
            "length": "Each installment in a Fantasy or Science Fiction Series typically ranges from 300 to 1,000 pages. Word count per book often varies between 80,000 to 250,000 words. A series can span from a trilogy to ten or more books, making the entire series potentially exceed a million words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Poetry"
            ],
            "name": "Poetry Collection",
            "description": "A Poetry Collection is an anthology of poems, often by a single author, that may revolve around a specific theme, emotion, or subject. These collections provide readers with insights into the human experience, conveyed through rhythmic and often lyrical language. The poems within a collection can vary widely in style, structure, and tone, but together they form a cohesive narrative or exploration of the chosen theme.",
            "methodology": "Theme Identification: Decide on a theme, emotion, or subject that the collection will revolve around.\nPoem Generation: Write individual poems. These can be crafted over time, often inspired by personal experiences, observations, or deep introspection.\nOrdering: Once a significant number of poems are written, determine the order in which they should appear. This order can influence the reader's journey and the narrative flow of the collection.\nRevision: Revisit each poem, refining language, structure, and rhythm. Consider the impact and emotion each piece conveys, ensuring it aligns with the collection's overall vision.\nFeedback: Share the collection with peers, mentors, or critique groups. Gain insights into how individual poems and the overall collection resonate with readers.\nFinalizing: After making necessary revisions, finalize the collection. This involves deciding on a title, writing a preface or introduction if desired, and considering any complementary art or design elements for publication.",
            "genres": [
                "Lyric",
                "Narrative",
                "Epic",
                "Satirical",
                "Haiku",
                "Sonnet",
                "Free Verse",
                "Acrostic",
                "Limerick",
                "Ballad"
            ],
            "length": "Typically 30 to 150 pages. Ranges from 50 to 300 poems. Depending on the length and style of the poems, word count can vary greatly. A typical median value for a poem might be around 100 words, making the collection's word count range from 5,000 to 30,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Non-Fiction"
            ],
            "name": "Recipe Book",
            "description": "",
            "methodology": "",
            "genres": [
                ""
            ],
            "length": "1,000 to 7,500 words",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Journalism",
                "Series",
                "Non-Fiction",
                "Article"
            ],
            "name": "Journalism/Article Series",
            "description": "A Journalism/Article Series consists of a sequence of articles or reports, usually written by a single journalist or a team, focusing on a particular topic, event, or issue. This series allows for an in-depth exploration of the subject, offering various perspectives, insights, and detailed information over multiple installments. The aim is to provide readers with a comprehensive understanding while maintaining engagement throughout the series.",
            "methodology": "Topic Selection: Choose a subject that warrants deep exploration and has potential for multiple articles.\nResearch: Dive into the subject, gathering sources, conducting interviews, and collecting data to ensure accuracy and comprehensiveness.\nSegmentation: Break down the topic into subtopics or angles that each article will cover. This segmentation will guide the structure of the series.\nDrafting: Write individual articles ensuring each piece can stand alone while being a part of the larger narrative.\nRevision: Review and refine each article, ensuring consistency in tone, style, and information across the series.\nFeedback: Have peers or editors review the series for accuracy, coherence, and engagement. Adjust based on feedback.\nPublication Strategy: Plan the release of the articles. This could be daily, weekly, or at other intervals, depending on the platform and audience.",
            "genres": [
                "Investigative Journalism",
                "News Report",
                "Feature Stories",
                "Opinion/Editorial",
                "Profile",
                "Review",
                "Explanatory Journalism",
                "Data Journalism",
                "Photojournalism",
                "Narrative Journalism"
            ],
            "length": "Each article typically ranges from 800 to 2,500 words. A series might include 3 to 10 articles. Therefore, the entire series could range from 2,400 to 25,000 words, with a median value of around 10,000 words. In terms of page count, each article could be 2 to 10 pages, making the entire series range from 6 to 100 pages, with a typical median value around 40 pages.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Journalism",
                "Series",
                "Non-Fiction",
                "Article"
            ],
            "name": "Magazine Feature",
            "description": "A Magazine Feature is a detailed article typically centered on a specific subject, person, event, or theme, tailored for a magazine audience. Unlike regular news articles, feature articles dive deeper into their subject, providing background, analysis, and often a more personal or human-interest angle. They are usually accompanied by photographs, illustrations, or infographics, enhancing the visual and informative appeal.",
            "methodology": "Topic Identification: Select a subject that holds interest and relevance for the magazine's target audience.\nResearch: Extensively research the topic, which might include interviews, site visits, and data collection.\nAngle Determination: Decide on the specific angle or perspective that makes the feature unique or intriguing.\nDrafting: Write the feature, ensuring it maintains the reader's interest with a mix of facts, narratives, and personal touches.\nVisual Elements: Collaborate with photographers or illustrators to obtain or create relevant visual content to accompany the feature.\nRevisions: Refine and adjust the text based on feedback and to ensure it aligns well with the visual elements.\nEditing and Proofreading: Thoroughly check for grammar, factual accuracy, and style coherence.\nFinalizing: Work with magazine designers to integrate the feature seamlessly into the magazine layout.",
            "genres": [
                "Profile Feature",
                "Human Interest",
                "Investigative Feature",
                "Historical Retrospective",
                "Travel and Lifestyle",
                "Tech and Innovation",
                "Culture and Art",
                "Health and Wellness",
                "Opinion and Commentary",
                "Fashion and Beauty"
            ],
            "length": "Typically 2 to 10 pages. Ranges from 1,200 to 5,000 words. A typical median value is around 2,500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Series",
                "Non-Fiction",
                "Article"
            ],
            "name": "Commentary or Review",
            "description": "A review offers critical commentary and evaluation of a work, product, service, or experience, aimed at helping audiences make informed decisions or appreciate the subject's nuances. Commonly encountered in media, arts, technology, and consumer goods sectors, reviews analyze and provide perspectives, drawing from the reviewer's expertise, experience, and personal opinions.",
            "methodology": "Experience the Subject: Whether it's reading a book, watching a film, using a product, or dining at a restaurant, the first step is to thoroughly engage with the subject being reviewed.\nTake Notes: During or immediately after the experience, jot down impressions, standout elements, pros, cons, and any particular details that strike as important.\nResearch: Gain more context by looking into the background of the subjectbe it the history of a product, the track record of a creator, or comparable items in the market.\nStructure the Review: Determine the review's structure, often starting with an overview, delving into specific details, and concluding with an overall rating or recommendation.\nDrafting: Write the review, ensuring a balance of factual detail, personal experience, and critical evaluation.\nRevising: Refine the content for clarity, coherence, and objectivity, while retaining the personal voice and opinion of the reviewer.\nEditing: Proofread for grammar, accuracy, and style.\nFinalizing: Depending on the medium, collaborate with designers or editors to ensure that the review fits the publication's format and style.",
            "genres": [
                "Book Reviews",
                "Film and TV Reviews",
                "Music Album Reviews",
                "Tech Product Reviews",
                "Restaurant and Food Reviews",
                "Theater and Performance Reviews",
                "Video Game Reviews",
                "Travel Destination Reviews",
                "Fashion and Beauty Product Reviews",
                "Service Reviews"
            ],
            "length": "Typically 1 to 5 pages. Ranges from 500 to 3,000 words. A typical median value is around 1,200 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Research",
                "Article"
            ],
            "name": "Research Report",
            "description": "A research report is a detailed and organized document that presents findings from systematic investigation into a particular subject or problem. The aim of a research report is to provide a clear and structured summary of the study's design, methodology, results, discussions, and conclusions. It serves as an important tool for conveying scientific, academic, or market research insights to the intended audience.",
            "methodology": "Identifying the Problem: Begin by defining the research question or problem statement.\nLiterature Review: Conduct a comprehensive review of existing literature to understand current knowledge and to identify gaps.\nMethodology Design: Detail the methods used for data collection and analysis. This includes the research approach, tools, sample size, and techniques.\nData Collection: Gather data through experiments, surveys, interviews, or other means, ensuring adherence to ethical standards.\nData Analysis: Use statistical or qualitative methods to analyze the data, extracting meaningful patterns and insights.\nDrafting: Compile the report starting with the introduction, followed by methodology, results, discussion, and conclusion. Include charts, graphs, and tables as necessary.\nRevising: Review the content for clarity, coherence, and completeness.\nEditing: Check the report for grammar, punctuation, consistency, and format as per standards or guidelines.\nFinalizing: Append necessary supplementary materials like appendices, and ensure proper citation. Obtain peer reviews or feedback, then make final revisions before publication or submission.",
            "genres": [
                "Scientific Research Report",
                "Market Research Report",
                "Social Science Research Report",
                "Medical and Clinical Research Report",
                "Educational Research Report",
                "Technical Research Report",
                "Economic Research Report",
                "Environmental Research Report",
                "Psychological Research Report",
                "Historical Research Report"
            ],
            "length": "Typically 10 to 100 pages. Ranges from 3,000 to 50,000 words. A typical median value is around 12,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction"
            ],
            "name": "Memoir",
            "description": "A memoir is a subgenre of autobiography, but rather than detailing the entirety of the author's life, it focuses on specific events or periods, offering a deep and intimate reflection on those experiences. Memoirs often explore themes of personal growth, relationships, and the human condition, providing readers with a window into the author's world and insights into broader societal contexts.",
            "methodology": "Reflection and Recollection: Start by revisiting personal memories, journals, letters, and any other materials that can aid in remembering past events.\nThematic Identification: Determine the central theme or message you wish to convey through your memoir. This can revolve around specific events, relationships, or transformative experiences.\nResearch: Validate memories, especially if referring to specific events, dates, or places. This might involve talking to family members, friends, or using other resources to ensure accuracy.\nOutlining: Create a roadmap of the memoir, breaking down the narrative into chapters or sections. Decide on the flow, considering chronological or thematic structures.\nDrafting: Begin writing, bringing the past to life through vivid descriptions, dialogues, and reflections.\nRevising: Go through the draft, enhancing emotional depth, clarity, and continuity in the narrative.\nEditing: Refine the text for grammar, style, and coherence. It might also be prudent to consider the feelings of others mentioned in the memoir and make adjustments accordingly.\nFinalizing: Share the memoir with trusted individuals for feedback, then make the necessary adjustments. Consider professional editing before publication.",
            "genres": [
                "Coming-of-Age Memoir",
                "Travel Memoir",
                "Grief Memoir",
                "Addiction and Recovery Memoir",
                "Family Memoir",
                "Historical Memoir",
                "Celebrity Memoir",
                "Adventure Memoir",
                "Relationship Memoir",
                "Inspirational Memoir"
            ],
            "length": "Typically 100 to 400 pages. Ranges from 40,000 to 100,000 words. A typical median value is around 65,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction"
            ],
            "name": "Autobiography",
            "description": "An autobiography is a self-written account of the author's life. Unlike a memoir, which focuses on specific events or periods in an author's life, an autobiography provides a comprehensive chronicle from birth to the present day or to a specific endpoint. Autobiographies often detail the author's personal experiences, relationships, challenges, and achievements, offering readers a detailed look into the author's journey and personal growth.",
            "methodology": "Life Chronology: Begin by mapping out the major events and milestones in your life, from birth to the present.\nResearch and Verification: Rely on personal diaries, letters, photos, and discussions with family and friends to ensure the accuracy of dates, places, and events.\nTheme Identification: Though comprehensive, most autobiographies have underlying themes or messages. Determine the overarching theme or lessons you want your life's story to convey.\nOutlining: Organize the narrative, deciding whether to follow a strict chronological order or to group related events and experiences together.\nDrafting: Start writing, detailing events and reflecting on their significance. This is where your story comes alive with descriptions, dialogues, emotions, and personal insights.\nRevising: Review the draft, refining the narrative flow, and ensuring that all key events are included and well-represented.\nEditing: Correct for grammar, punctuation, style, and factual inconsistencies. Depending on the public interest, consider potential legal and ethical implications, especially when discussing others.\nFinalizing: Share your autobiography with close acquaintances or professionals for feedback. Make necessary revisions and consider seeking a professional editor or agent for publishing.",
            "genres": [
                "Historical Autobiography",
                "Celebrity Autobiography",
                "Political Autobiography",
                "Adventure Autobiography",
                "Spiritual Autobiography",
                "Scientific Autobiography",
                "Business Autobiography",
                "Sports Autobiography",
                "Artistic Autobiography",
                "Philosophical Autobiography"
            ],
            "length": "Typically 200 to 600 pages. Ranges from 50,000 to 150,000 words. A typical median value is around 90,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction"
            ],
            "name": "Biography",
            "description": "A biography is a detailed account of another person's life, written by an author who is not the subject of the work. This narrative chronicles the life of the subject from birth to death, or to a specific endpoint, emphasizing major events, achievements, and contributions. Biographies often shed light on the subject's personal and professional life, influences, challenges, and the impact they had on the world or their field of expertise.",
            "methodology": "Subject Selection: Identify a person whose life story presents interest, relevance, and offers valuable insights.\nPreliminary Research: Gather basic information about the subject to gauge the scope of the project.\nIn-depth Research: Dive deeper into various sources like books, articles, interviews, personal letters, and archival materials to gather comprehensive details about the subject's life.\nInterviews: If possible, conduct interviews with people who knew the subject personally or are experts in the subject's field to gain unique perspectives and firsthand accounts.\nThesis Development: Determine the central theme or message of the biography. This could be a particular aspect of the subject's life or the overarching impact they had.\nOutlining: Organize the gathered information chronologically or thematically, depending on the narrative's focus.\nDrafting: Start writing, weaving together factual accounts with engaging narrative techniques to make the biography compelling.\nRevising: Review and refine the narrative, ensuring that all significant events are well-documented and the story flows seamlessly.\nEditing: Address grammar, punctuation, factual inconsistencies, and style. Ensure that all sources are accurately cited.\nFinalizing: Seek feedback from peers, experts, or potential readers, and make necessary revisions. Consider working with a professional editor or publisher.",
            "genres": [
                "Historical Biography",
                "Celebrity Biography",
                "Political Biography",
                "Adventure Biography",
                "Literary Biography",
                "Scientific Biography",
                "Business Biography",
                "Sports Biography",
                "Artistic Biography",
                "Philosophical Biography"
            ],
            "length": "Typically 150 to 500 pages. Ranges from 40,000 to 130,000 words. A typical median value is around 80,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Non-Fiction"
            ],
            "name": "Travel Guide",
            "description": "A travel guide is a comprehensive resource aimed at assisting travelers in exploring and enjoying a particular destination. It provides detailed information about places of interest, local customs, transportation, accommodation, dining, and entertainment. Beyond mere facts, a travel guide often offers tips, itineraries, and insights to help travelers make the most of their journey, ensuring a memorable experience.",
            "methodology": "Destination Selection: Choose a destination or a specific region of interest based on its tourist appeal.\nField Research: Visit the destination to experience its attractions firsthand. This provides a genuine perspective and aids in capturing the essence of the place.\nData Collection: Gather detailed information about points of interest, historical sites, cultural attractions, local eateries, accommodations, transportation modes, and other relevant topics.\nInterviews: Engage with local experts, residents, and fellow travelers to gain diverse insights and uncover hidden gems.\nOrganizing Information: Categorize information based on themes, such as history, culture, outdoor activities, dining, and accommodations.\nDrafting: Begin writing, ensuring a clear structure and providing readers with easy-to-follow recommendations and tips.\nPhotography & Illustrations: Incorporate high-quality images and maps to visually enhance the guide and help readers navigate the destination.\nRevising: Review the content to ensure accuracy, relevance, and up-to-date information. Travel destinations and their offerings can change over time, so it's essential to keep the guide current.\nEditing: Correct grammar, punctuation, and style. Ensure that all information is presented in a user-friendly manner.\nFinalizing: Consider adding user testimonials, ratings, or reviews. Collaborate with designers for layout and cover design, and consider digital interactivity if producing an e-guide.",
            "genres": [
                "City Guide",
                "Country Guide",
                "Adventure Travel Guide",
                "Cultural Travel Guide",
                "Historical Travel Guide",
                "Nature & Wildlife Guide",
                "Road Trip Guide",
                "Beach & Island Guide",
                "Culinary Travel Guide",
                "Budget Travel Guide"
            ],
            "length": "Typically 100 to 400 pages. Ranges from 25,000 to 100,000 words. A typical median value is around 60,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Collection",
                "Non-Fiction",
                "Journal"
            ],
            "name": "Travel Journal",
            "description": "A travel journal is a personal record of an individual's experiences, feelings, observations, and reflections during their travels. Unlike a travel guide, which provides objective information and recommendations, a travel journal is subjective and captures the emotions, perceptions, and personal growth of the writer. It's a space for intimate reflections, sketches, photographs, and mementos that chronicle a journey.",
            "methodology": "Choosing a Format: Decide whether to use a physical journal, a digital platform, or a combination of both. Some prefer the tactile experience of writing, while others might use blogs or apps for easy sharing.\nDaily Entries: Make a habit of jotting down experiences each day, capturing feelings, observations, interactions, and even the weather.\nPhotographs & Sketches: Enhance entries with photos or hand-drawn sketches of sights, people, or experiences that made an impact.\nReflection: Take time to ponder on the deeper significance of events or experiences. How have they changed your perspective or understanding?\nCollecting Mementos: Attach ticket stubs, postcards, or other small tokens that serve as reminders of places visited.\nRevisiting & Editing: Especially for digital journals or blogs, go back and refine entries, add details, or provide context for readers.\nSharing: If desired, share excerpts or entire entries with friends, family, or a wider audience through social media, blogs, or printed copies.\nFinalizing: At the end of the journey, reflect on the overall experience, personal growth, and transformative moments. Consider adding a conclusion or a summary.",
            "genres": [
                "Solo Travel Journal",
                "Adventure Travel Journal",
                "Cultural Immersion Journal",
                "Road Trip Journal",
                "Backpacking Journal",
                "Nature Exploration Journal",
                "Spiritual Journey Journal",
                "Family Vacation Journal",
                "Gap Year Journal",
                "Expat Diary"
            ],
            "length": "Typically 20 to 200 pages. Ranges from 5,000 to 50,000 words. A typical median value is around 25,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Research"
            ],
            "name": "Case Study",
            "description": "A case study is a detailed and in-depth examination of a particular case or example within a real-world context. Often used in academic, scientific, or business settings, case studies aim to analyze specific phenomena, situations, or challenges, drawing conclusions from the information presented. They are used to provide insights into larger generalities, offering practical solutions or highlighting best practices.",
            "methodology": "Subject Selection: Choose a representative or unique case that will provide meaningful insights.\nResearch: Gather comprehensive information about the chosen subject. This could involve interviews, document analysis, observation, or other research methods.\nFramework Definition: Define the analytical framework or theoretical context that will be used to evaluate the case.\nData Collection: Accumulate detailed and relevant data about the case. This might include qualitative or quantitative data, dependent on the study focus.\nAnalysis: Analyze the collected data, determining key patterns, relationships, or insights relevant to the study's goals.\nDrafting: Write an initial version of the case study, ensuring a structured presentation of the introduction, background, analysis, and conclusions.\nPeer Review: If in an academic setting, submit the draft for peer review to ensure accuracy and validity.\nRevising: Incorporate feedback, correct inaccuracies, and refine the narrative for clarity and impact.\nFinalizing: Once satisfied, finalize the document. For business contexts, consider adding recommendations or action items based on the case study's findings.",
            "genres": [
                "Business Strategy",
                "Medical/Healthcare",
                "Psychological Analysis",
                "Social Research",
                "Environmental Studies",
                "Technology Implementation",
                "Marketing Effectiveness",
                "Educational Practices",
                "Economic Analysis",
                "Legal Precedent"
            ],
            "length": "Typically 5 to 30 pages. Ranges from 2,500 to 15,000 words. A typical median value is around 5,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Research"
            ],
            "name": "White Paper",
            "description": "A white paper is a comprehensive and authoritative report or guide that addresses a specific issue, provides a solution, or educates readers about a complex topic. Commonly used in government, business, and tech sectors, white papers are designed to influence or inform decision-makers. They are thoroughly researched and present an in-depth analysis, often leveraging data, case studies, and expert opinions.",
            "methodology": "Topic Identification: Determine the specific issue, challenge, or opportunity that the white paper will address.\nResearch: Conduct extensive research to gather relevant data, facts, case studies, and expert opinions related to the topic.\nObjective Definition: Clearly outline the objectives of the white paper, including the primary message and desired outcomes (e.g., influencing policy, promoting a solution).\nContent Structuring: Organize the information in a logical sequence, often starting with an executive summary, followed by the problem definition, presented solutions or recommendations, and concluding remarks.\nDrafting: Write the initial draft of the white paper, ensuring clarity, authority, and comprehensiveness.\nVisualization: Incorporate graphs, charts, infographics, and other visual aids to help illustrate and support key points.\nReview & Feedback: Seek feedback from stakeholders, industry experts, or target audience representatives to refine the content.\nRevising: Make necessary changes based on feedback and ensure the paper is coherent and persuasive.\nFinalizing & Publishing: Once satisfied, finalize the document, consider appropriate branding, and distribute or publish as intended.",
            "genres": [
                "Technology Solutions",
                "Government Policy",
                "Business Strategies",
                "Medical Advancements",
                "Financial Models",
                "Legal Analysis",
                "Environmental Concerns",
                "Educational Reform",
                "Market Analysis",
                "Product Launch"
            ],
            "length": "Typically 10 to 50 pages. Ranges from 5,000 to 20,000 words. A typical median value is around 8,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Research"
            ],
            "name": "Academic Paper/Thesis",
            "description": "An academic paper or thesis is a detailed research document submitted in partial fulfillment of a degree or to contribute to academic literature in a specific field. It presents an original hypothesis or argument, backed by rigorous research, methodologies, and evidence. An academic paper aims to contribute new knowledge or insights to its respective field and is often peer-reviewed before being published in academic journals or presented at conferences.",
            "methodology": "Topic Selection: Choose a specific, focused topic that fills a research gap in the chosen field.\nLiterature Review: Conduct an exhaustive review of existing literature to understand previous research, theories, and findings related to the topic.\nResearch Question/Hypothesis: Formulate a clear and concise research question or hypothesis based on identified gaps in the literature.\nMethodology Selection: Decide on the research methods (e.g., qualitative, quantitative, experiments, surveys) that will best answer the research question.\nData Collection: Gather data through experiments, fieldwork, surveys, interviews, or other methods, ensuring ethical considerations are met.\nData Analysis: Analyze the collected data using appropriate tools and techniques, drawing conclusions and interpretations.\nDrafting: Write the initial draft, typically including sections like introduction, literature review, methodology, results, discussion, and conclusion.\nPeer Review (if for publication): Submit the draft for peer review to receive feedback and suggestions for improvement.\nRevisions: Incorporate feedback, refine arguments, and ensure clarity and coherence.\nSubmission/Finalizing: Submit the finalized academic paper or thesis to the appropriate academic body, journal, or conference.",
            "genres": [
                "Natural Sciences",
                "Social Sciences",
                "Humanities",
                "Engineering",
                "Medical Studies",
                "Business and Economics",
                "Law Studies",
                "Arts and Design",
                "Educational Research",
                "Environmental Studies"
            ],
            "length": "For Academic Papers: Typically 10 to 30 pages. Ranges from 3,000 to 10,000 words. A typical median value is around 5,000 words. For Theses: Typically 40 to 400 pages. Ranges from 20,000 to 100,000 words. A typical median value for a master's thesis might be 40,000 words, while a doctoral dissertation can be 80,000 words or more.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Collections",
                "Journal"
            ],
            "name": "Blog Posts",
            "description": "A blog post is a digital content piece published on a website, usually written in an informal or conversational style. It's intended to provide information, insights, opinions, or personal anecdotes on a variety of topics. Blog posts are versatile and are used for various purposes, such as educating readers, sharing news, reflecting on personal experiences, or promoting products and services.",
            "methodology": "Topic Selection: Decide on a relevant, engaging topic based on the blog's target audience and objectives.\nResearch: Gather information, statistics, and relevant data on the chosen topic, ensuring accuracy and credibility.\nOutlining: Create a rough structure or flow for the post, listing the main points or sections.\nDrafting: Write the initial content, keeping in mind the audience's preferences and the blog's tone and style.\nIncorporating Multimedia: Depending on the platform and audience, include relevant images, videos, infographics, or other multimedia elements.\nRevising: Review the content for coherence, flow, and engagement. Ensure the information is clear and well-organized.\nEditing: Check for grammatical errors, punctuation mistakes, and consistency in tone and style.\nOptimization: For digital platforms, optimize the content for search engines by incorporating relevant keywords, meta descriptions, and alt tags.\nPublication: Post the content on the chosen platform, ensuring proper formatting.\nPromotion: Share the blog post on social media, email newsletters, and other channels to increase its reach and visibility.",
            "genres": [
                "Personal/Lifestyle",
                "Travel",
                "Food & Cooking",
                "Tech & Gadgets",
                "Health & Wellness",
                "Business & Marketing",
                "DIY & Crafts",
                "Fashion & Beauty",
                "Entertainment & Pop Culture",
                "News & Current Events"
            ],
            "length": "Typically 1 to 5 pages. Ranges from 300 to 2,500 words. A typical median value is around 1,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Manual"
            ],
            "name": "Technical Manual",
            "description": "A technical manual is a comprehensive document that provides detailed information, guidelines, and instructions on how to use, maintain, assemble, or troubleshoot a specific product, software, or system. Designed for specialized users or technicians, these manuals prioritize clarity, precision, and thoroughness to ensure accurate and safe use of the related product or system.",
            "methodology": "Product Familiarization: Gain a deep understanding of the product or system in question. This may involve hands-on experimentation, consultation with product engineers, or reviewing initial documentation.\nResearch: Gather all available data, schematics, specifications, and any prior documentation related to the product.\nDetermine Audience Needs: Understand the technical level of the intended audience and tailor the content accordingly.\nOutlining: Organize the content into logical sections or chapters, such as introduction, setup, operation, maintenance, and troubleshooting.\nDrafting: Write clear and concise step-by-step instructions, ensuring each step is unambiguous and accurate. Incorporate diagrams, illustrations, and tables where necessary.\nTechnical Review: Have the content reviewed by product engineers or experts to ensure technical accuracy.\nEditing: Ensure clarity, coherence, and consistency in the language. Check for grammatical and typographical errors.\nUsability Testing: If possible, have a sample of the target audience use the manual to interact with the product. Revise content based on their feedback.\nFinal Review and Layout: Check the manual's design and layout to ensure it is user-friendly. Include an index or glossary for easy reference.\nDistribution: Make the manual available in both digital and printed formats, as appropriate for the product and its audience.",
            "genres": [
                "Electronics & Gadgets",
                "Software & Applications",
                "Machinery & Heavy Equipment",
                "Automobiles & Vehicles",
                "Medical Devices",
                "Household Appliances",
                "Computer Hardware",
                "Networking Equipment",
                "Construction Tools",
                "Aerospace & Aviation"
            ],
            "length": "Variable based on the product's complexity. Typically ranges from 20 to 500 pages. Word count can range from 10,000 to 150,000 words. A typical median value is around 50,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Manual"
            ],
            "name": "How-to Guide",
            "description": "A how-to guide is a step-by-step instructional document or piece of content intended to assist readers in accomplishing a specific task or activity. Written in a direct and practical manner, it aims to simplify complex procedures and provide clear directions. Typically, it involves breaking down tasks into digestible steps accompanied by relevant images or diagrams, ensuring even novice users can achieve desired outcomes.",
            "methodology": "Task Identification: Clearly define the task or procedure that the guide will cover. Understand the challenges and common pitfalls associated with it.\nAudience Analysis: Determine the expertise level of your target audience. A guide for beginners will differ significantly from one meant for experts.\nResearch: Collect all necessary materials, tools, and data relevant to the task. This ensures accuracy and thoroughness in the guide.\nDrafting an Outline: Break down the task into logical, sequential steps. Consider the inclusion of tips, warnings, or notes where relevant.\nWriting Steps: Describe each step clearly and concisely. Avoid jargon unless it's explained or familiar to the audience. Wherever possible, include visuals like screenshots, diagrams, or photos to illustrate the step.\nPractical Testing: Follow the guide as written to ensure each step is accurate and achievable. Adjust steps if any ambiguities or challenges arise.\nPeer Review: Have someone else review the guide. This offers a fresh perspective and may identify overlooked details or ambiguities.\nEditing and Polishing: Refine the language for clarity, coherence, and consistency. Ensure visuals are clear and appropriately captioned.\nUser Feedback: If possible, let a sample of the target audience use the guide and gather their feedback. Revise based on their experiences and challenges.\nFinal Review: Ensure all steps are clear, logical, and free of errors. Consider a table of contents or an index for longer guides.",
            "genres": [
                "Home & Garden",
                "Technology & Gadgets",
                "Cooking & Baking",
                "Crafts & DIY Projects",
                "Health & Fitness",
                "Automotive",
                "Beauty & Fashion",
                "Travel",
                "Finance & Budgeting",
                "Business & Marketing"
            ],
            "length": "Typically 1 to 30 pages. Ranges from 500 to 15,000 words. A typical median value is around 2,500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Manual"
            ],
            "name": "Business Plan",
            "description": "A business plan is a formal written document that outlines the goals of a business, the strategy and tactics for achieving them, and the expected financial performance over a certain period. It serves as a roadmap for the business's operations and direction, as well as a tool to attract investors or secure loans. A comprehensive business plan delves into market analysis, competitive landscape, marketing strategies, operations, and financial projections, among other facets.",
            "methodology": "Purpose Definition: Identify the main purpose of the business plan, whether it's for internal planning, investment seeking, or another motive.\nExecutive Summary: Write a brief overview capturing the essence of the business, its goals, and its strategies.\nMarket Research: Investigate and analyze the industry, market size, trends, and target audience to determine viability and positioning.\nCompetitive Analysis: Identify key competitors, their strengths, weaknesses, and market positioning.\nMarketing and Sales Strategy: Define how the business plans to attract and retain customers, including marketing channels, strategies, and sales tactics.\nProduct or Service Description: Detail what the business offers, its unique selling proposition, pricing strategy, and lifecycle.\nOperational Plan: Describe the day-to-day operations, including supply chain, logistics, and production processes.\nManagement and Organization: Highlight the team's structure, roles, responsibilities, and key personnel bios.\nFinancial Projections: Estimate revenues, costs, and profits over a specific period, typically 3-5 years. This may include income statements, balance sheets, cash flow statements, and capital expenditure budgets.\nRisk Assessment: Identify potential risks and the strategies in place to mitigate them.\nAppendices: Add any additional information or data that supports the main content, such as market studies, resumes of key personnel, or detailed financial calculations.\nFinal Review: Ensure coherence, consistency, and professionalism throughout the document. It's often beneficial to seek feedback from mentors, peers, or professionals in the industry.",
            "genres": [
                "Startup",
                "Retail",
                "E-commerce",
                "Tech & Software",
                "Healthcare",
                "Agriculture",
                "Manufacturing",
                "Hospitality",
                "Finance & Fintech",
                "Education"
            ],
            "length": "Typically 15 to 50 pages. Ranges from 3,000 to 25,000 words. A typical median value is around 10,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction",
                "Manual"
            ],
            "name": "Training Manual/Workbook",
            "description": "A training manual or workbook is a structured document or book that provides detailed instructions, information, and exercises to help a user develop a new skill or knowledge in a particular area. It acts as both a reference guide and a step-by-step roadmap for learners, offering theory, practical examples, and exercises to reinforce learning. Typically used in professional and educational settings, training manuals can address a wide range of subjects from software usage, machinery operation, to soft skills and leadership training.",
            "methodology": "Needs Assessment: Understand the learning needs and objectives by consulting stakeholders, trainers, or the target audience.\nContent Gathering: Assemble existing materials, articles, resources, and expert insights relevant to the training topic.\nContent Structuring: Organize the material in a logical sequence, typically from basic concepts to more complex ones.\nInstructional Design: Use principles of adult learning and pedagogy to ensure the content is engaging, interactive, and effective. This might include adding exercises, quizzes, case studies, and real-world examples.\nDrafting: Write the content in a clear, concise, and instructional tone, ensuring it caters to different learning styles.\nInclusion of Visuals: Integrate diagrams, illustrations, charts, and screenshots to complement and clarify the text.\nFeedback Loop: Share the draft with subject matter experts, trainers, and a sample of the target audience for feedback.\nRevisions: Based on feedback, make necessary revisions to enhance clarity, accuracy, and engagement.\nFinalization & Formatting: Ensure consistent formatting, add a table of contents, glossary, and index if necessary. Also, consider adding bookmarks or interactive features if it's a digital manual.\nEvaluation: After the training, gather feedback to assess the effectiveness of the manual and make improvements in future editions.",
            "genres": [
                "Software & IT",
                "Machinery & Equipment Operation",
                "Human Resources & Onboarding",
                "Sales & Customer Service",
                "Leadership & Management",
                "Health & Safety",
                "Product Knowledge",
                "Language & Communication",
                "Financial Processes",
                "Professional Development"
            ],
            "length": "Typically 20 to 150 pages. Ranges from 5,000 to 50,000 words. A typical median value is around 20,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Poetry"
            ],
            "name": "Epic Poem",
            "description": "An epic poem is a lengthy narrative poem that usually relates a story concerning a heroic figure or a significant event, often blending mythological or historical elements with moral lessons and philosophical reflections. It traditionally employs elevated language and style, adhering to specific patterns and structures. Epic poems have been instrumental in preserving, propagating, and celebrating cultural stories, histories, and values, serving as an important medium of communication in ancient societies.",
            "methodology": "Topic Selection: Decide on the central theme, hero, or event that the epic will revolve around.\nResearch & Lore Gathering: Delve deep into historical records, myths, or folk tales related to the chosen theme to gather relevant details and ensure authenticity.\nFramework Design: Create a skeletal structure or outline of the epic, deciding on the major events, turning points, and climax.\nCharacter Development: Flesh out primary and secondary characters, defining their motivations, relationships, and roles in the narrative.\nVerse Structuring: Choose a specific meter or rhythmic pattern, often hexameter or dactylic pentameter in traditional epics.\nDrafting: Begin with writing individual episodes or sections, focusing on vivid imagery, grand settings, and dramatic dialogues.\nStylistic Elements: Integrate recurring motifs, divine interventions, extended similes, and other stylistic elements common to epics.\nRevising: Revisit the work to refine language, enhance coherence, and ensure thematic consistency.\nFeedback & Refinement: Share the poem with trusted peers, scholars, or literary critics to gather feedback and make refinements.\nFinalization: After multiple iterations, finalize the epic, ensuring that it conveys the desired moral, philosophical, and cultural messages.",
            "genres": [
                "Heroic Adventure",
                "Historical Recount",
                "Mythological",
                "Allegory",
                "Tragic Romance",
                "Moral & Philosophical Reflections",
                "War & Battles",
                "Quest & Exploration",
                "Divine & Supernatural",
                "Cultural & Nationalistic"
            ],
            "length": "Typically 3,000 to 30,000 lines. Ranges from 10,000 to 500,000 words. A typical median value is around 60,000 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Non-Fiction"
            ],
            "name": "Essay",
            "description": "An essay is a short piece of writing on a particular subject or theme, often presenting the author's personal views, insights, or arguments. It is a flexible literary form that allows for exploration of ideas in depth, drawing from personal experiences, research, or philosophical musings. Essays can be formal or informal in nature, and they can address a wide range of topics, from the trivial to the profound.",
            "methodology": "Topic Selection: Choose a specific subject or theme that interests you or addresses a current issue or debate.\nResearch: If the essay requires a factual basis, conduct preliminary research to gather relevant information and supporting evidence. This might include reading books, articles, or accessing other scholarly resources.\nThesis Statement: Formulate a clear, concise statement that encapsulates your main argument or point of view.\nPlanning & Structuring: Organize your thoughts and create an outline, defining the introduction, body paragraphs, and conclusion.\nDrafting: Write the initial draft, focusing on developing your argument and providing relevant examples and evidence.\nRevision: Review and refine your essay, ensuring clarity, coherence, and logical flow. Check for potential gaps in your argument or areas that need further elaboration.\nEditing: Proofread for grammatical, punctuation, and stylistic errors. Ensure that the language is appropriate for your target audience and the type of essay (formal/informal).\nPeer Review: If possible, have peers or mentors review your essay for feedback.\nFinalization: Make final edits based on feedback received and ensure that your essay presents a well-argued, insightful perspective on the chosen topic.",
            "genres": [
                "Personal Reflection",
                "Argumentative/Persuasive",
                "Descriptive",
                "Narrative",
                "Expository",
                "Analytical",
                "Cause and Effect",
                "Compare and Contrast",
                "Problem-Solution",
                "Philosophical"
            ],
            "length": "Typically 2 to 10 pages. Ranges from 500 to 5,000 words. A typical median value is around 1,500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Poetry"
            ],
            "name": "Lyrics/Songwriting",
            "description": "Lyrics, when paired with music, form the essence of a song. They express emotions, tell stories, or share messages, complementing the melody and rhythm. Lyrics can range from simple and catchy phrases to deep and poetic verses. Songwriting involves crafting not only the words but often the melody, harmony, and rhythm that accompany them, resulting in a complete musical piece.",
            "methodology": "Inspiration & Theme: Identify a theme or emotion you want the song to convey. This can arise from personal experiences, stories, or external influences.\nMelody & Rhythm Creation: Some songwriters start with creating a basic melody or a chord progression. This provides a musical framework for the lyrics.\nLyric Drafting: Begin writing the lyrics, considering the song structure (verse, chorus, bridge, etc.). Keep in mind the rhythm and melody when crafting lines.\nRevision: Refine the lyrics for clarity, emotional impact, and musical fit. Adjust any lines that seem out of place or don't flow well with the music.\nCollaboration: If you're working with other musicians or a band, collaborate to ensure the lyrics fit well with the music and that the song feels cohesive.\nRecording & Feedback: Record a demo of the song, even if it's just a basic recording. Listening to it can provide insights for further refinement. Share with trusted peers for feedback.\nFinalization: Make any final tweaks to the lyrics and music. The song can then be professionally recorded or performed live.",
            "genres": [
                "Pop",
                "Rock",
                "R&B/Soul",
                "Hip-Hop/Rap",
                "Country",
                "Jazz",
                "Blues",
                "Electronic/Dance",
                "Folk",
                "Classical/Crossover"
            ],
            "length": "Typically 1 to 5 pages. Ranges from 100 to 1,000 words. A typical median value is around 250 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        },
        {
            "tags": [
                "Script"
            ],
            "name": "Speech/Keynote",
            "description": "A speech or keynote is a structured oral presentation delivered to an audience, often with the purpose of informing, persuading, or inspiring. The content can range from sharing personal experiences to discussing new research or developments in a particular field. Speeches often incorporate storytelling elements, statistical data, and powerful rhetoric to engage and move the audience.",
            "methodology": "Topic Selection: Choose a relevant and impactful topic, keeping in mind the interests and needs of the target audience.\nResearch: Gather accurate and pertinent information about the topic, incorporating data, anecdotes, quotes, and relevant historical context.\nOutlining: Structure the speech into a clear beginning, middle, and end. Ensure there's a logical flow of ideas and that each segment supports the main message.\nDrafting: Write the initial version of the speech. Consider incorporating personal stories, humor, and powerful language to engage the audience.\nRevising: Review the content for clarity, coherence, and impact. Refine the language and eliminate any redundancy.\nPractice: Rehearse the speech multiple times, adjusting for pacing, emphasis, and body language. This also helps with memorization.\nFeedback: Share the speech with trusted individuals for feedback on content, clarity, and delivery.\nFinalizing: Make any final edits, rehearse again, and prepare any visual aids or props if necessary.",
            "genres": [
                "Inspirational/Motivational",
                "Educational",
                "Ceremonial (e.g., weddings, graduations)",
                "Persuasive",
                "Informative",
                "Commemorative",
                "Entertainment",
                "Business/Corporate",
                "Political",
                "Technical"
            ],
            "length": "Typically 2 to 10 pages. Ranges from 500 to 5,000 words. A typical median value is around 1,500 words.",
            "links": [],
            "structure": {},
            "imageref": "",
            "created": "",
            "modified": "",
            "usage_count": 0
        }
    ]
}